# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    #[-1, 3, C3, [64]],                      #V13 less layers in backbone and head
   [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2   #V12 replaces all Conv layers with C3 but the last
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4     #V10 V12
   [-1, 3, C3, [128]],                       #V10 
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4     #non V13
   [-1, 3, C3, [128]],                       #non V13
   #[-1, 6, C3, [256]],                      # non V12
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8    #non V13
   [-1, 9, C3, [256]],                      #non V13
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8    #V12 V13
   [-1, 9, C3, [256]],                     #V13
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16    #V10 V12
   #[-1, 9, C3, [512]],                        # non V12
   [-1, 9, C3, [512]],                       #V10  V13
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16    #non V13
   [-1, 9, C3, [512]],                       #non V13
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32  #V12 
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9            #SPPF Has also no batchnorm in v12
  ]

# YOLOv5 v6.0 head
head:
  [
   #[-1, 1, Conv, [128, 1, 1]],                   # non V13
   #[-1, 1, nn.Upsample, [None, 2, 'nearest']],   #non V13  
   #[[-1, 2], 1, Concat, [1]],  # cat backbone P2 #non V13
   #[-1, 3, C3, [128, False]],  #                 #non V13
   
   #[-1, 3, C3, [512, False]],                     # non V12
   [-1, 1, Conv, [512, 1, 1]],                   #V11 #V12 replaces conv with C3
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   #V11  
   [[-1, 10], 1, Concat, [1]],  # cat backbone P4 #V11 V13 10 - 6
   [-1, 3, C3, [512, False]],  #                 #V11
   
  # [-1, 3, C3, [256, False]],                     # non V12
   [-1, 1, Conv, [256, 1, 1]],                   #V11 V12 V13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   #V11 V13
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3 #V11 V13 6 - 4
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small) #V11 V13

   #[-1, 3, C3, [512, False]],                   # non V12
   [-1, 1, Conv, [256, 3, 2]],                 #V10 #V11  V12
   [[-1, 14], 1, Concat, [1]],  # cat head P4  #V10 #V11 
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium) #V10 #V11

   [-1, 1, Conv, [512, 3, 2]],  #V12 last conv stays
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
